Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/Microchip.PIC32CZ-CA90_DFP.pdsc
         <device Dname="PIC32CZ8110CA90144">
            <processor Dcore="Cortex-M7"
                       Dendian="Little-endian"
                       Dmpu="MPU"
                       Dfpu="DP_FPU"/>
            <compile header="CA90/include/pic32c.h" define="__PIC32CZ8110CA90144__"/>
            <memory id="IROM1" start="0x4000000" size="0x8000"/>
            <memory id="IROM2"
                    start="0x8000000"
                    size="0x20000"
                    default="1"
                    startup="1"/>
            <memory id="IROM3" start="0xA000000" size="0x1000"/>
            <memory id="IROM4" start="0xA002000" size="0x1000"/>
            <memory id="IROM5" start="0xA004000" size="0x1000"/>
            <memory id="IROM6" start="0xA008000" size="0x1000"/>
            <memory id="IROM7" start="0xA00A000" size="0x1000"/>
            <memory id="IROM8" start="0x0A00C000" size="0x1000"/>
            <memory id="IRAM1" start="0x00000000" size="0x20000" default="1"/>
            <memory id="IRAM2" start="0x20000000" size="0x20000"/>
            <memory id="IRAM3" start="0x20020000" size="0x100000"/>
            <memory id="IRAM4" start="0x80000000" size="0x10000000"/>
            <memory id="IRAM5" start="0x90000000" size="0x10000000"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="CA90/atdf/PIC32CZ8110CA90144.atdf"/>
                  <at:variant ordercode="PIC32CZ8110CA90144-I/LUX"
                              vccmin="1.66"
                              vccmax="3.66"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="PIC32CZ8110CA90144-V/LUX"
                              vccmin="1.66"
                              vccmax="3.66"
                              tempmin="-40"
                              tempmax="105"/>
                  <at:variant ordercode="PIC32CZ8110CA90144-E/LUX"
                              vccmin="1.66"
                              vccmax="3.66"
                              tempmin="-40"
                              tempmax="125"/>
                  <at:variant ordercode="PIC32CZ8110CA90144-I/BAD"
                              vccmin="1.66"
                              vccmax="3.66"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="PIC32CZ8110CA90144-V/BAD"
                              vccmin="1.66"
                              vccmax="3.66"
                              tempmin="-40"
                              tempmax="105"/>
                  <at:variant ordercode="PIC32CZ8110CA90144-E/BAD"
                              vccmin="1.66"
                              vccmax="3.66"
                              tempmin="-40"
                              tempmax="125"/>
                  <at:memory name="ITCM"
                             start="0x00000000"
                             size="0x20000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="PRM_ROM"
                             start="0x4000000"
                             size="0x8000"
                             type="rom"
                             rw="R"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="FCR_BFM"
                             start="0x8000000"
                             size="0x20000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="FCR_CFM_USERCFG1"
                             start="0xA000000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FCR_CFM_USEROTP1"
                             start="0xA001000"
                             size="0x1000"
                             type="user_signatures"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FCR_CFM_BOOTCFG1"
                             start="0xA002000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FCR_CFM_DALCFG"
                             start="0xA004000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FCR_CFM_CALOTP"
                             start="0xA007000"
                             size="0x1000"
                             type="other"
                             pagesize="4096"
                             rw="R"
                             address-space="base"/>
                  <at:memory name="FCR_CFM_USERCFG2"
                             start="0xA008000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FCR_CFM_USEROTP2"
                             start="0xA009000"
                             size="0x1000"
                             type="user_signatures"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FCR_CFM_BOOTCFG2"
                             start="0xA00A000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FCR_CFM_HSMCFG0"
                             start="0x0A00C000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FCR_CFM_HSMCFG1"
                             start="0x0A00D000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FCR_CFM_HSMCFG2"
                             start="0x0A00E000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FCR_CFM_HSMCFG3"
                             start="0x0A00F000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FCR_PFM"
                             start="0xC000000"
                             size="0x800000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="DTCM"
                             start="0x20000000"
                             size="0x20000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="FLEXRAM"
                             start="0x20020000"
                             size="0x100000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="APBA"
                             start="0x44000000"
                             size="0x800000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="APBB"
                             start="0x44800000"
                             size="0x800000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="APBC"
                             start="0x45000000"
                             size="0x800000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="APBD"
                             start="0x45800000"
                             size="0x800000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="APBE"
                             start="0x46000000"
                             size="0x800000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="APBF"
                             start="0x46800000"
                             size="0x800000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="SQI0_SFR"
                             start="0x4F008000"
                             size="0x1000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="SQI1_SFR"
                             start="0x4F009000"
                             size="0x1000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="USBHS0_SFR"
                             start="0x4F010000"
                             size="0x2000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="USBHS1_SFR"
                             start="0x4F012000"
                             size="0x2000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="HSM_SFR"
                             start="0x4F018000"
                             size="0x400"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="SQI0_XIP"
                             start="0x80000000"
                             size="0x10000000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             external="true"
                             address-space="base"/>
                  <at:memory name="SQI1_XIP"
                             start="0x90000000"
                             size="0x10000000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             external="true"
                             address-space="base"/>
                  <at:memory name="PPB"
                             start="0xE0000000"
                             size="0x20000000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="CM7H_ROM_TABLE"
                             start="0xE00FE000"
                             size="0x100"
                             type="rom"
                             rw="R"
                             exec="true"
                             address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ice4"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="CA90/edc/PIC32CZ8110CA90144.PIC"/>
                  <mchp:xc32 name="CA90/xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="CA90/hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="CA90/hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="CA90/hwtools/sdm/sdmICE4.xml"/>
                     <mchp:file name="CA90/hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="CA90/hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="CA90/hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="CA90/hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="CA90/hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="CA90/hwtools/sdm/sdmSimulator.xml"/>
                     <mchp:file name="CA90/hwtools/sdm/sdmRealICE4.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="CA90/hwtools/persfr/arm32.persfr"/>
                  </mchp:hwtool>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.20-"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32CZ8110CA90144"
                  title="Device page for PIC32CZ8110CA90144"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32CZ8110CA90144"
                  title="Datasheet"/>
         </device>
