Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/Microchip.PIC32CZ-CA90_DFP.pdsc
         <device Dname="PIC32CZ8110CA90208S1">
            <processor Dcore="Cortex-M0+"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"/>
            <compile header="CA90-S1/include/pic32c.h" define="__PIC32CZ8110CA90208S1__"/>
            <debug svd="CA90-S1/svd/PIC32CZ8110CA90208S1.svd"/>
            <memory id="IROM1"
                    start="0x0A00C000"
                    size="0x1000"
                    default="1"
                    startup="1"/>
            <memory id="IROM2" start="0x0A00D000" size="0x1000"/>
            <memory id="IROM3" start="0x0A00E000" size="0x1000"/>
            <memory id="IROM4" start="0x0A00F000" size="0x1000"/>
            <memory id="IROM5" start="0x20000000" size="0x8000"/>
            <memory id="IRAM1" start="0x10000000" size="0x20000" default="1"/>
            <memory id="IRAM2" start="0x53800000" size="0x20"/>
            <memory id="IRAM3" start="0x60000000" size="0x10000000"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="CA90-S1/atdf/PIC32CZ8110CA90208S1.atdf"/>
                  <at:memory name="FCR_CFM_HSMCFG0"
                             start="0x0A00C000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FCR_CFM_HSMCFG1"
                             start="0x0A00D000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FCR_CFM_HSMCFG2"
                             start="0x0A00E000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FCR_CFM_HSMCFG3"
                             start="0x0A00F000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="RAM"
                             start="0x10000000"
                             size="0x20000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="ROM"
                             start="0x20000000"
                             size="0x8000"
                             type="rom"
                             rw="R"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="APBA"
                             start="0x50000000"
                             size="0x3000000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="BATTREGS"
                             start="0x53800000"
                             size="0x20"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="APBB"
                             start="0x54000000"
                             size="0xC000000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="AUX_INTF"
                             start="0x60000000"
                             size="0x10000000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             external="true"
                             address-space="base"/>
                  <at:memory name="PPB"
                             start="0xE0000000"
                             size="0x20000000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ice4"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="CA90-S1/edc/PIC32CZ8110CA90208S1.PIC"/>
                  <mchp:xc32 name="CA90-S1/xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="CA90-S1/hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="CA90-S1/hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="CA90-S1/hwtools/sdm/sdmICE4.xml"/>
                     <mchp:file name="CA90-S1/hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="CA90-S1/hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="CA90-S1/hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="CA90-S1/hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="CA90-S1/hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="CA90-S1/hwtools/sdm/sdmSimulator.xml"/>
                     <mchp:file name="CA90-S1/hwtools/sdm/sdmRealICE4.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="CA90-S1/hwtools/persfr/arm32.persfr"/>
                  </mchp:hwtool>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.20-"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32CZ8110CA90208S1"
                  title="Device page for PIC32CZ8110CA90208S1"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32CZ8110CA90208S1"
                  title="Datasheet"/>
         </device>
      </family>
   </devices>
   <conditions>
      <condition id="ARMCC Exe">
         <accept Tcompiler="ARMCC" Toutput="exe"/>
      </condition>
      <condition id="GCC">
         <accept Tcompiler="GCC"/>
      </condition>
      <condition id="GCC Exe">
         <accept Tcompiler="GCC" Toutput="exe"/>
      </condition>
      <condition id="IAR Exe">
         <accept Tcompiler="IAR" Toutput="exe"/>
      </condition>
      <condition id="XC">
         <accept Tcompiler="XC"/>
      </condition>
      <condition id="C">
         <accept Tcompiler="ARMCC"/>
         <accept Tcompiler="GCC"/>
         <accept Tcompiler="IAR"/>
      </condition>
      <condition id="C Exe">
         <accept Tcompiler="ARMCC" Toutput="exe"/>
         <accept Tcompiler="GCC" Toutput="exe"/>
         <accept Tcompiler="IAR" Toutput="exe"/>
      </condition>
      <condition id="C Lib">
         <accept Tcompiler="ARMCC" Toutput="lib"/>
         <accept Tcompiler="GCC" Toutput="lib"/>
         <accept Tcompiler="IAR" Toutput="lib"/>
      </condition>
      <condition id="PIC32CZ2051CA90100">
         <require Dvendor="Microchip:3" Dname="PIC32CZ2051CA90100"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
