Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/Microchip.PIC32CZ-CA90_DFP.pdsc
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CZ8110CA90176">
         <description>Headers and startup code for Microchip PIC32CZ8110CA90176</description>
         <files>
            <file condition="C" category="include" name="CA90/include/"/>
            <file condition="C" category="header" name="CA90/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="CA90/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="CA90/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="CA90/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="CA90/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="CA90/gcc/gcc/startup_pic32cz8110ca90176.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="CA90/gcc/system_pic32cz8110ca90176.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="CA90/gcc/gcc/pic32cz8110ca90176_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="CA90/gcc/gcc/pic32cz8110ca90176_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="CA90/armcc/armcc/startup_pic32cz8110ca90176.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="CA90/armcc/system_pic32cz8110ca90176.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="CA90/iar/iar/startup_pic32cz8110ca90176.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="CA90/iar/system_pic32cz8110ca90176.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="CA90/iar/config/linker/Microchip/pic32cz8110ca90176/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="CA90/iar/config/linker/Microchip/pic32cz8110ca90176/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CZ8110CA90176S1">
         <description>Headers and startup code for Microchip PIC32CZ8110CA90176S1</description>
         <files>
            <file condition="C" category="include" name="CA90-S1/include/"/>
            <file condition="C" category="header" name="CA90-S1/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="CA90-S1/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="CA90-S1/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="CA90-S1/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="CA90-S1/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="CA90-S1/gcc/gcc/startup_pic32cz8110ca90176s1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="CA90-S1/gcc/system_pic32cz8110ca90176s1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="CA90-S1/gcc/gcc/pic32cz8110ca90176s1_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="CA90-S1/gcc/gcc/pic32cz8110ca90176s1_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="CA90-S1/armcc/armcc/startup_pic32cz8110ca90176s1.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="CA90-S1/armcc/system_pic32cz8110ca90176s1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="CA90-S1/iar/iar/startup_pic32cz8110ca90176s1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="CA90-S1/iar/system_pic32cz8110ca90176s1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="CA90-S1/iar/config/linker/Microchip/pic32cz8110ca90176s1/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="CA90-S1/iar/config/linker/Microchip/pic32cz8110ca90176s1/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CZ8110CA90208">
         <description>Headers and startup code for Microchip PIC32CZ8110CA90208</description>
         <files>
            <file condition="C" category="include" name="CA90/include/"/>
            <file condition="C" category="header" name="CA90/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="CA90/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="CA90/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="CA90/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="CA90/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="CA90/gcc/gcc/startup_pic32cz8110ca90208.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="CA90/gcc/system_pic32cz8110ca90208.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="CA90/gcc/gcc/pic32cz8110ca90208_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="CA90/gcc/gcc/pic32cz8110ca90208_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="CA90/armcc/armcc/startup_pic32cz8110ca90208.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="CA90/armcc/system_pic32cz8110ca90208.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="CA90/iar/iar/startup_pic32cz8110ca90208.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="CA90/iar/system_pic32cz8110ca90208.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="CA90/iar/config/linker/Microchip/pic32cz8110ca90208/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="CA90/iar/config/linker/Microchip/pic32cz8110ca90208/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CZ8110CA90208S1">
         <description>Headers and startup code for Microchip PIC32CZ8110CA90208S1</description>
         <files>
            <file condition="C" category="include" name="CA90-S1/include/"/>
            <file condition="C" category="header" name="CA90-S1/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="CA90-S1/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="CA90-S1/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="CA90-S1/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="CA90-S1/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="CA90-S1/gcc/gcc/startup_pic32cz8110ca90208s1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="CA90-S1/gcc/system_pic32cz8110ca90208s1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="CA90-S1/gcc/gcc/pic32cz8110ca90208s1_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="CA90-S1/gcc/gcc/pic32cz8110ca90208s1_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="CA90-S1/armcc/armcc/startup_pic32cz8110ca90208s1.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="CA90-S1/armcc/system_pic32cz8110ca90208s1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="CA90-S1/iar/iar/startup_pic32cz8110ca90208s1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="CA90-S1/iar/system_pic32cz8110ca90208s1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="CA90-S1/iar/config/linker/Microchip/pic32cz8110ca90208s1/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="CA90-S1/iar/config/linker/Microchip/pic32cz8110ca90208s1/flash.icf"
                  attr="config"/>
         </files>
      </component>
   </components>
</package>
